app/controllers/materials_controller.rb

  def index
    @materials = Material.all
---
SELECT `materials`.* FROM `materials`

  def create
    @material = Material.new(material_params)

    respond_to do |format|
      if @material.save
---
INSERT INTO `materials` (`user_id`, `content_type`, `content_value`, `status`, `internal_comment`, `external_comment`, `created_user_id`, `updated_user_id`, `created_at`, `updated_at`) VALUES (1, 1, 'コンテンツタイプはテキスト', 0, '新規案件です', 'ただ今審査中です', 1, 1, '2017-02-01 10:08:00', '2017-02-01 10:08:00')

    def set_material
      @material = Material.find(params[:id])
---
SELECT  `materials`.* FROM `materials` WHERE `materials`.`id` = 1 LIMIT 1