app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page])

INSERT INTO `users` (`email`, `name`, `created_at`, `updated_at`, `password_digest`) VALUES ('zagan.the.gun@gmail.com', 'zagan', '2017-02-07 08:49:18', '2017-02-07 08:49:18', '$2a$10$E/nPmCsSb4DccMb9HE9V7.UdfQd4.xndi1Vs6VZJf5630cifSBAC.')
---
  def create
    @user = User.new(user_params)
#    debugger
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `name` = '石塚 玄太', `password_digest` = '$2a$10$ypzZuG/j1ZWjNY67AKEPL.LtfKebP4rlXuXpnuzGA7BosXcf/X2oy', `updated_at` = '2017-02-20 04:50:06' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

DELETE FROM `users` WHERE `users`.`id` = 2
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy